{"architecture":{"class_name":"Functional","config":{"name":"sequential","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,4,16],"dtype":"float32","sparse":false,"ragged":false,"name":"input_1"},"name":"input_1","inbound_nodes":[]},{"class_name":"SimpleRNN","config":{"name":"simple_rnn","trainable":true,"batch_input_shape":[null,4,16],"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"time_major":false,"units":16,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null},"shared_object_id":1},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null},"shared_object_id":2},"bias_initializer":{"class_name":"Zeros","config":{},"shared_object_id":3},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0},"name":"simple_rnn","inbound_nodes":[[["input_1",0,0,{}]]]},{"class_name":"TimeDistributed","config":{"name":"time_distributed","trainable":true,"dtype":"float32","layer":{"class_name":"Activation","config":{"name":"activation","trainable":true,"dtype":"float32","activation":"tanh"}}},"name":"time_distributed","inbound_nodes":[[["simple_rnn",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["time_distributed",0,0]]},"keras_version":"2.9.0","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[4,16]],"output_shapes":[[4,16]],"tests":[{"inputs":[{"shape":[4,16],"values":["26oIvxvpwT5cUuq/bMcOv8ULZr9ecLI+IRRbPwK2DT++y5g/3mJevvEFH71zvsO/RNpAvx9Uhz9rjYQ/A624P39q8z4eFCy+37yUv/IvJT6x3Eo/pAzRvVPgcT96IgVAGAYGv0Qg9L57784/tZzKP6LJJz+MYxO/P+YFP2C+MD++Hyy/VsiEPqIkDz/YFYe/ynIrvsnhgL/YDZs+TZ0bvaKSrr+UQdQ+UiwSPxUbED9ilBi/51xlPg7t9b0CAbW/lts/Py+yRz/lfGY/36aDPsxj/D3O5SA+Q9miv88zJL7Ux4a/bCS5PjuPVL4QFpK/shIZQLD/Bz7r48k+ynLRvQ=="]}],"outputs":[{"shape":[4,16],"values":["4DE/v0TlOT/3Bjy/7RE/v5EyIz7bvh8/euciP9bUK7/NSDK/hKrpPqsNPj+HS6M+0IopP6XuPb86kuQ+q59Av5f3Qr/W90I/1vdCv873Qr9m6kI/1vdCP9b3Qj9WiAe/zPdCv9b3Qj/W90I/z/dCvy33Qj9Eaju/Tnc/v3b3Qr+3Jpo+uPdCP0P0Qr835Si/9eM6P9/YPT+B10I/ifVCv06bQb9m9kI/85k9P+q0Qr+tdUE/Ao5Cv6S/Qj/Xrz+/P8ZCv9b3Qj8D9kK/kPJCv/AOQT+x9EI/4PRCP4i+8b4zZi+/1PdCP+j2Qj9B80K/0PVCP5rGQr/KyzY/QN1Bvw=="]}]}],"trainable_params":{"time_distributed":{"td_input_len":["AAAAQA=="],"td_output_len":["AAAAQA=="]}},"hash":"d6d6ec21a247cececbb4b0607c5a048c9ae7222e35e195b9fec659e2db830a1a"}