{"architecture":{"class_name":"Functional","config":{"name":"sequential","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,7],"dtype":"float32","sparse":false,"ragged":false,"name":"input_1"},"name":"input_1","inbound_nodes":[]},{"class_name":"Dense","config":{"name":"dense","trainable":true,"batch_input_shape":[null,7],"dtype":"float32","units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense","inbound_nodes":[[["input_1",0,0,{}]]]},{"class_name":"Activation","config":{"name":"activation","trainable":true,"dtype":"float32","activation":"tanh"},"name":"activation","inbound_nodes":[[["dense",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"batch_input_shape":[null,64],"dtype":"float32","units":4,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_1","inbound_nodes":[[["activation",0,0,{}]]]},{"class_name":"Activation","config":{"name":"activation_1","trainable":true,"dtype":"float32","activation":"softmax"},"name":"activation_1","inbound_nodes":[[["dense_1",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["activation_1",0,0]]},"keras_version":"2.9.0","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[7]],"output_shapes":[[4]],"tests":[{"inputs":[{"shape":[7],"values":["ifTAvmlAob9jP0M/O38PvR0nzT+pqaE/RRe1vg=="]}],"outputs":[{"shape":[4],"values":["KqV/P+EMVjqZChI6kfBONw=="]}]}],"trainable_params":{"dense":{"weights":["QrfEPUlb67+Qvcu+ze6Yv3Wo1j/rbia+Gz6QP79thD/Jsiu+lrnDvo62YT8BOoC9x3d9PjQUlb1adAU+NwCVv1Nm7r4zbbC/z5CBvtvGEz2HblO+HZJxvwPmQr88X5O+OxQ6PzxrAb8fEf++6XniPXu3rb4WpPU+HWN9vy9aoj5NjSQ/T3CPPBnHZL89o5S++qsCPkKM5L4/vQY/F7F5vpsXnL7Xcdi/7ipuv8sqEb98sqA/t9SKv4nPWT5OAaa9jOrJvgYFCcApARU97oqAv/BbxD7XKl2/HdIPQOUFoD6AXKw/f3BNv/UNiL74TdW+59wnP92IfL47Aag++NcRP5C/xj7RC+k/BpGqvxHyC8DU4i6/UmgVvvbOpz49kx6/AvY4v6jIob4MpPc/fGSJvY6H3b5Yshw/nMO6PD2uQr/iKCg/9lCSPxX5jL6PBQ69D+F+Pl6d2T2bGAw/t2lSv2h9Cj/87Fs/XYphPYySyb1KAbw+/sIBP+nY1b1gHvO9Szy2vj3VuD5qeRk/d4kVv/mhGr8aMMq7aFnIvluSgL5uaXI/BciJvmyd070bch+/6aQrvo5OLj8SKxK/Geewvg19Jj9Jnqs/xpHYvgwd3L+WSm2+o/TOP+b5EMA7bj29YynuPhmPUj8i0Xm+dgswPx2JL79Aggk+bO/uPZBJCb/LBBg/35Revz1qwz48/ClA+Ajsvp19lb5yg/i+KmM3v3gOJT3o+rq9lB+Hv/7UQD48KiA+4QlGPjLDWL5Yos6/78dQvz+du78jO5W+jZqgvdPgoT9vlgC/vJD+vP3SyzxLLsg+TzKXPoQFlj5W+ls+CNDcvY4z7D5uI9g+a6eZveJvOT2TPjk+mEXpv/vhAkAb9vs+TRaHPkXZxD7Ifxo/VDGrvxWoWL99Hli/uwG9P9fwiL4H3JQ+/ZLZPaCQCb+Q6N0+gh/4vu9bub2Vyzs/C98kvsizN79uFxFA1gQrP6Dzkb9LA3m+1uajvvSF3j5e47e+1HoWPvy3Ir58sUA+","lv8fv7Fe/L8WTIW/khntv2mjrL9wEmg94/AxPy1ETT71LuI+EEg+PEgCCMBHoW68lvBpvlDeIL8qk2K+bIYEQPXkLr76tY0/edjlvncgMT7HTZG/Is7Pv3KFUT89Dli/FlPSv7LnK78TnIO8YeqEvZEcSD5nRDu/SlelvdSMzb4vuZ++5dv2vmtCaD8cnbU/5d/gPttchT6o2sS9ERgbPfaWYr93nBY/r4yPPypMr75wPBq/aTCbP1GGjT6eWIg+9q0GP68+ib95sLW+XFzKP5GMSb6LOM0/zloUwCfa8L6gaYm8Dn8kP25ZkL9y7x8/+m+Lv5SxID6DAuW+m/Y7v3yMSL5ROOe/w7rmvrW9j7/QT9A/NHwVPiTnc79w1os/i1c/vbRmBT3KsG4/CjeYPBKlOD4lDqa9zpUoPJm7iL8g8xg/SK68v2m3s74HrE68HlGOP1+BgL+XqkC/Mg2avhkeLj9oS7K+fkkmP55dLDzFihY/R4qWPpQThb+1rLM+OCUgv1ymKT6FfGq/euCUvS8VCD6xfpI+KZx6vnMWCD6NLxI/FT+0PzKYM7/mHwa+fRFRv19Khr9/D8W8mffmvixwsb4xhw3A8RMtvZCkh7+fxRm+TPc3v3pjD0DpEVu+wRNqv4j7SL9pL1a/sfjavqieGj/XcWg+RgCnvjD77j5vX7m8RofkP3DX3T8y0RrAeTAJv5gorb0Z4Qi/eENKP/NuZL+HJkM+NBPIP69b9j16lQm/sR1ZvUbGdb2Iq0e/eJ4iPsC7eT+iIWM+kcYtvp8n0T6JJ/Q9EojqPj/YzL7auBu/0f1pvz69nL09aJm+ve7APOFsTb9nccm9SJvDPXNXZb4NSXC+8WM6PxWVRj8HzoS+At0+vSReGr6BRta9Ee0yv+zczb6drrm+wVBCv9kLu71xwxE/edaAPyPd/76VXVE/LdCpPyjE6L5WPfw/q2LWvmCY2D/J1hbAlv59vgRLYj9SqbG9/aupPmz/Oj+i+ng+th6aPgNnab6xH9+7","f5H2Pg1tSL+fyLC/lZAoQLPu/b6sRsG+girivv5t575HuAo/KCbPPPdjoL80+907v1xwuyZ36j6sSaK+NNnyvwKmRD+q59Q/WffyvhPKCj5Qypc/SbvAvgbLBT7XIlO+FjeNPi8Jsz2qaSA8YkjFPsnZ9z6p7ew+LtgHP2rBFr5xRc0+GY9WPG6i4L97KNm/674dP3KICzwa5i0/aWQ1v2tFXj8jZVm/zxpjv3e+qL9/8Bm+PEfRPrTMf761UxW/vwE2v5d9sr5ClN4+NEpCP2wwhz2UyM6+g2X3P0a2JD/CwJ8/15laPnVgB7+Zcx6/pCgIv4Tspr4bLA2+jTzFPA=="],"bias":["LFCXvu01tj4UJge+571ZPgBZRb4Y/DS+z08fP0BslD3dHic+WSZ1PlUH0r6B8Fw+0NfWPb4Zcz3d6eU77w86PbuuCD9UNwY9tvNhPlNgKb+DJqA8Eo5zPaBIGj5iIVi+1Ae1vnlzn76Bri4/7iLUvXFixT3g1OS+WjwMPpH7HD5XFQO/C/rjvehHhj7SHkQ+JEazvsw0lD5iUc++jdsav9rtHb/NnLK+KeyEvhRixj7Rt2g+9dpHPf3fET92OES9qHxfvogGHD936ek+Hn62vuAPYj5Dhqa+px6hv4FKpb5+Ro4+BRjIPnU7hL7qvwq+LY5wPrYm2z6CGIA+8BLFvg=="]},"dense_1":{"weights":["yaZCv8zz/T2/jjA/uSLsPts577/vB6A/mZ20P/mBwr/jArA+PuUxvzVr5z6WyK4/JAHzv7H8yT9eodY/OG4SwNXZkr9w5Dc/M0CGPw6n0r+TQWQ+Cnq4vmOgLj5K2NE+T4hjPnsGAD8C1qq9sgmVvxm/hr/99Z0+a4WRPyB3Bz5VfAW/bTWMPuqX1T6v2CS/asOoPgPMR73hkeO8Wge9vpVw5T+AMcI/Xb8YwMaz0L/PtRM+csTLPSJgjj5Zt2C+gxGGPlR2kz6On3a+j/46vdREVL4FF2Y+sYETP/cOrL1pFoc+MgXPvgvZ5z1Wexc9AFaPv5r6cj8F5nQ/YjePv3q8gT3UVjw+gQ85P7hPgb9A/LI/P8nBvz/ibz9zh3W/OapNPoRWAr9eaQQ/VI6svjVmB750xsS9a0pKvv1vlj/gHlY/9fAxvgB1Or/Wf+k9FYQvP6EzAb9vpeq+cPCKPnYGEz8kaA6/ImqYvT2kCT9U0sC9q23QvsPE0j45OhI+97Cjv1bNoT5a6Yw/dMZ4vkvPAz9H0BS+bUQVv7xOOj/dN9k9Nv0SPvddZbyk2Zy/zo3gvSyfwz7/UEe+CkJJPp1Wpb4aCh8/obczvut+Pr87QjW/j/3iPCXgKL6JZRA/q/RnPrtcpT78Nci8HyslvzPqqb1i4iy+wY+OPr6H5b414gK/LuRnvYxQgb4SwWY/JKJDvkaB4L713Mg+3nZhPhQxhT4Qpf++QnMDPz5+37/YioK+UmcGP73Zkz+3utC/iOxKv9LDcD2U8kq9XrcFP4C7bL30ICm9GaZ7PvWLOL8m6C2/qz7vPQ0dh744O+Y+/hUXvp0kOr60Y/W+Q9JqP5tX0DzAKwK/Eu1XvwSesj+RZMO+q1kCv3DGsT7akaw/veA9v7NPCD8+tNI+3Owxvn7DUD/x7dO+Za12v+iLaj/lLAg/TRksvwzMEL9q2FU/VTcuP7baMb+kmBi/shmUP4PYwr0jZmg6Io3sPjlRk7/YbxO+8sSVvlVgBD9euAq9","aE+dvu/ERr+EzNI+YJuzPoUINb+Uvw0/XczGP1OcJcCvDA4/Vt4GPxHVK75UKl6/skxhP9gemz/69wnA/sb9vu9u3z5sfzM+qVq/vv7Egr103b+/+w9DPnLRDz+MF6w/wzoiQKnVP8Ax4vs/Wu0NwFAXGr8ffbI+9AXOPeVbsD06yRG/QZ6xvo8phj/PNz+/6EZQP4fPjb5Yb7u+IdEqvjK0+b2R2Oi+b8QWvgUq2D7mMzG+R3MdvzhQMT9ZqbG90jKevslTjrzdwVM/DPADvzJXUj40ah++E6HjPrxnXb+aLOk+xoLwvr2tUL67D7y+qgIMv4C+Hz+MdMw+03euPg=="],"bias":["Wl8XPt4SFj58Wbs8HG0Wvw=="]}},"hash":"0f12246dd43e6e03de415abb159cd1787ba9fb3723d41019e83423a22a3cfe02"}