Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 simple_rnn (SimpleRNN)      (None, 16)                528       
                                                                 
=================================================================
Total params: 528
Trainable params: 528
Non-trainable params: 0
_________________________________________________________________
losstf.Tensor([1.08444766e-07 1.08365150e-07], shape=(2,), dtype=float32)
Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 simple_rnn (SimpleRNN)      (None, 16)                528       
                                                                 
=================================================================
Total params: 528
Trainable params: 528
Non-trainable params: 0
_________________________________________________________________
loss: tf.Tensor([6.2315269e-07 6.2346777e-07], shape=(2,), dtype=float32)
