Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 simple_rnn (SimpleRNN)      (None, 16)                528       
                                                                 
=================================================================
Total params: 528
Trainable params: 528
Non-trainable params: 0
_________________________________________________________________
losstf.Tensor([5.6877991e-07 5.6892975e-07], shape=(2,), dtype=float32)
Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 simple_rnn (SimpleRNN)      (None, 16)                528       
                                                                 
=================================================================
Total params: 528
Trainable params: 528
Non-trainable params: 0
_________________________________________________________________
loss: tf.Tensor([2.9253141e-07 2.9150917e-07], shape=(2,), dtype=float32)
